---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedWhenLoadingFamily
source: html/e1420e0d-f8fb-7d80-1813-aad0ad8eed95.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FailedWhenLoadingFamily Property

Some unlocked labeled dimensions prevent family from loading. Please try to lock unlocked labeled dimensions and load again.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedWhenLoadingFamily { get; }
```